Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh3808-v3.tmx
Source language: bo
Languages: en

source: རྒྱུ་ཡིན་པའི་ཕྱིར་རོ། །དུས་ཐམས་ཅད་དུ་ཡོངས་སུ་གྲུབ་པའི་མཚན་ཉིད་ནི་ཆོས་གནས་པ་ཉིད་ཅེས་གསུངས་ཏེ། དེ་བཞིན་གཤེགས་པ་རྣམས་བྱུང་ཡང་རུང་མ་བྱུང་ཡང་རུང་། ཆོས་རྣམས་ཀྱི་ཆོས་ཉིད་ནི་གནས་པ་ཉིད་དོ་ཞེས་གསུངས་པས། དུས་ཐམས་ཅད་དུ་གནས་པའི་ཕྱིར་རོ།
en: The mark of the thoroughly established that is constant is called the establishment of dharmas because it remains constantly, because it says, “Whether the tathāgatas arise or whether they do not arise this true nature of dharmas simply remains.”

source: །ཕྱིར་མི་ལྡོག་པར་ཡོངས་སུ་གྲུབ་པ་ནི་ཆོས་སྐྱོན་མེད་པ་ཉིད་ཅེས་གསུངས་པ་སྟེ། ས་དང་པོ་ཡན་ཆད་དེ་རབ་ཏུ་རྟོགས་པས། ཡང་དག་པ་ཉིད་དུ་ངེས་པ་ལ་ཞུགས་པར་འགྱུར་ཏེ། ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་སྐྱོན་མེད་པ་ལ་ཞུགས་པར་གྱུར་པའི་ཕྱིར་རོ།
en: The thoroughly established that is irreversible is called the certification of dharmas because by breaking through to the first level on up one goes forth to a state in which perfection is certain because one will have gone forth to perfect, complete awakening—to flawlessness.

source: །དེ་ཁོ་ན་ཉིད་དུ་ཡོངས་སུ་གྲུབ་པ་ནི་ཡང་དག་པའི་མཐའ་ཞེས་གསུངས་པ་སྟེ། ཡང་དག་པ་ཉིད་དེ་ཁོ་ན་ཉིད་ཕྱིན་ཅི་མ་ལོག་པའི་མཐར་ཐུག་པའི་ཕྱིར་རོ།
en: The thoroughly established that is true reality is called the very limit of reality because it reaches its limit in reality, in the true reality that is without error.

source: །རྟོག་གེའི་ལམ་ལས་འདས་པར་ཡོངས་སུ་གྲུབ་པ་ནི། བསམ་གྱིས་མི་ཁྱབ་པའི་དབྱིངས་ཞེས་གསུངས་པ་སྟེ། བརྗོད་དུ་མེད་པ་དང་། སོ་སོར་རང་གིས་རིག་པ་ཡིན་པས་རྗེས་སུ་དཔག་པ་ཐམས་ཅད་ཀྱི་སྤྱོད་ཡུལ་ལས་འདས་པའི་ཕྱིར་རོ།
en: The thoroughly established beyond the limit of logic is called the inconceivable element because it is inexpressible, self-reflexive analytic knowledge beyond the scope of all inference.

source: །གཞན་ཡང་ཀུན་བརྟགས་པའི་ཆོས་ཐམས་ཅད་ནི་རྨི་ལམ་ལྟ་བུ་སྟེ། རབ་ཏུ་རྟོགས་པར་གྱུར་པ་རྣམས་ལ།
en: Furthermore, all imaginary phenomena are like a dream because they are not like that when awakening has happened.

source: དེ་ལྟར་མི་འགྱུར་བས་དེ་ལས་བཟློག་པ་ལ་ནི་དེ་བཞིན་ཉིད་ཅེས་བྱ་སྟེ། དུས་ཐམས་ཅད་དུ་དེ་བཞིན་ཉིད་ཡོད་པའི་ཕྱིར་རོ།
en: The opposite of those is called suchness, because suchness exists at all times.

source: །ཆོས་ཐམས་ཅད་ནི་སྒྱུ་མ་ལྟ་བུ་སྟེ། ནོར་བར་སྣང་བའི་ཕྱིར་རོ། །དེ་ལས་བཟློག་པ་ནི་མ་ནོར་བ་དེ་བཞིན་ཉིད་ཅེས་བྱ་སྟེ། མ་ནོར་བའི་ངོ་བོ་ཉིད་ཡིན་པའི་ཕྱིར་རོ།
en: All dharmas are like an illusion because they are mistaken appearances, so the opposite of those is called unmistaken suchness, because it is an unmistaken nature.

source: །ཆོས་ཐམས་ཅད་ནི་སྨིག་རྒྱུ་ལྟ་བུ་སྟེ། གཞན་དུ་གནས་ལ་གཞན་དུ་སྣང་བའི་ཕྱིར་རོ། །དེ་ལས་བཟློག་པ་ནི་གཞན་མ་ཡིན་པ་དེ་བཞིན་ཉིད་ཅེས་བྱ་སྟེ། དུས་ཐམས་ཅད་དུ་གཞན་དུ་འགྱུར་བ་མེད་པའི་ཕྱིར་རོ།
en: All dharmas are like a mirage because while they are one thing they look like something else, so the opposite of those is called unaltered suchness because it does not ever change.

source: །ཆོས་ཐམས་ཅད་ནི་ཆུ་ཟླ་ལྟ་བུ་སྟེ། ཆོས་དེའི་བདག་ཉིད་མ་ཡིན་ལ། ཆོས་དེའི་བདག་ཉིད་དུ་སོ་སོར་སྣང་བའི་ཕྱིར་རོ། །ཆུ་ཟླ་ནི་ཟླ་བ་འམ་ཡང་དག་པ་མ་ཡིན་ཏེ། དེ་ལས་བཟློག་པ་ནི་ཆོས་ཉིད་ཅེས་བྱ་སྟེ།
en: All dharmas are like a reflection of the moon in water because, while that is not the actual nature of that phenomenon, it appears as that phenomenon’s actual nature, so the opposite of those is called the true nature of dharmas, because it is the nature of the ultimate.

source: དོན་དམ་པའི་ངོ་བོ་ཉིད་ཡིན་པའི་ཕྱིར་རོ། །ཆོས་ཐམས་ཅད་ནི་དྲི་ཟའི་གྲོང་ཁྱེར་ལྟ་བུ་སྟེ། དོན་མེད་པའི་ཕྱིར་རོ།
en: All dharmas are like a city of the gandharvas because they are meaningless.

source: །དེ་ལས་བཟློག་པ་ནི་ཆོས་ཀྱི་དབྱིངས་ཞེས་བྱ་སྟེ། སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ཀྱི་རྒྱུ་ཡིན་ཞིང་དོན་ཡོད་པའི་ཕྱིར་རོ།
en: The opposite of those is called the dharma-constituent because it is the cause of the buddhadharmas and is meaningful.

source: །ཆོས་ཐམས་ཅད་ནི་བྲག་ཅ་ལྟ་བུ་སྟེ། ཡུན་ཐུང་བའི་ཕྱིར་རོ།
en: All dharmas are like an echo because they are fleeting.

source: །དེ་ལས་བཟློག་པ་ནི་ཆོས་གནས་པ་ཉིད་ཅེས་བྱ་སྟེ། གནས་པའི་མཚན་ཉིད་ཡིན་པའི་ཕྱིར་རོ།
en: The opposite of those is called the establishment of dharmas because its mark is lasting.

source: །ཆོས་ཐམས་ཅད་ནི་མིག་ཡོར་ལྟ་བུ་སྟེ། མ་ངེས་པའི་ངོ་བོ་ཉིད་ཡིན་པའི་ཕྱིར་རོ།
en: All dharmas are like an apparition because they have a nature that is not fixed.

source: །དེ་ལས་བཟློག་པ་ནི་ཆོས་སྐྱོན་མེད་པ་ཉིད་ཅེས་བྱ་སྟེ། ངེས་པའི་ངོ་བོ་ཉིད་ཡིན་པའི་ཕྱིར་རོ།
en: The opposite of those is the certification of dharmas because its nature is fixed.

source: །ཆོས་ཐམས་ཅད་ནི་གཟུགས་བརྙན་ལྟ་བུ་སྟེ། རྣམ་པར་ཤེས་པའི་རྣམ་པར་འཕོས་པའི་ཕྱིར་རོ།
en: All dharmas are like a reflection in the mirror because they are a transference of consciousness.

source: །དེ་ལས་བཟློག་པ་ནི་ཡང་དག་པའི་མཐའ་ཞེས་བྱ་སྟེ། དོན་དམ་པ་ཡིན་པའི་ཕྱིར་རོ།
en: The opposite of those is the very limit of reality because it is the ultimate.

source: །ཆོས་ཐམས་ཅད་ནི་སྤྲུལ་པ་ལྟ་བུ་སྟེ། སེམས་ཀྱི་འདུ་བྱེད་ལས་བྱུང་བའི་ཕྱིར་རོ།
en: All dharmas are like a magical creation because they are karmically created by mind.

source: །དེ་ལས་བཟློག་པ་ནི་བསམ་གྱིས་མི་ཁྱབ་པའི་དབྱིངས་ཞེས་བྱ་སྟེ། ཡིད་ཀྱི་སྤྱོད་ཡུལ་ཐམས་ཅད་ལས་འདས་པའི་ཕྱིར་རོ།
en: The opposite of those is the inconceivable element because it is beyond the entire scope of the thinking mind.

source: །དོན་དམ་པར་ནི་ཐམས་ཅད་ཀྱང་ཡོངས་སུ་གྲུབ་པའི་ཆོས་ཀྱི་རྣམ་གྲངས་སོ།
en: Ultimately these are all synonyms of the thoroughly established.

source: །དེ་ལྟར་ཆོས་ཐམས་ཅད་ལ་འཕེལ་བ་དང་། འགྲིབ་པ་དམིགས་སུ་མེད་པས། སྒྲོ་འདོགས་པ་དང་སྐུར་བ་འདེབས་པའི་མཐའ་ཡོངས་སུ་སྤང་བར་བསྟན་ནས། ད་ནི་མིང་དམིགས་སུ་མེད་པར་བསྟན་པའི་ཕྱིར་བཅོམ་ལྡན་འདས་གང་ཡང་འདི་ལྟ་སྟེ། བྱང་ཆུབ་སེམས་དཔའ་ཞེས་ཆོས་ཉིད་ཀྱི་བརྡར་གདགས་པ་དེ་ཡང་།
en: Having eliminated over-reification and over-negation by teaching that you cannot apprehend the waxing and waning of all phenomena, to teach that a name cannot be apprehended, he says, “Lord, whatever this designation bodhisattva that is a conventional term for the true nature of dharmas is, it cannot be said to be aggregates, or constituents, or sense fields,” and so on.

source: ཕུང་པོ་རྣམས་སམ།
en: This teaching is in two parts.

source: ཁམས་སམ། སྐྱེ་མཆེད་རྣམས་གང་དུ་ཡང་བརྗོད་དུ་མ་མཆིས་སོ་ཞེས་བྱ་བ་ལ་སོགས་པ་གསུངས་ཏེ། འདིས་ནི་རྣམ་པ་གཉིས་བསྟན་ཏོ། །གང་དུ་ཡང་བརྗོད་པར་བགྱི་བ་མ་ལགས་ཞེས་བགྱི་བའི་འགྲེས་ཀྱིས་ནི་མིང་དང་ཕུང་པོ་དང་ཁམས་དང་སྐྱེ་མཆེད་ལ་སོགས་པའི་ཆོས་རྣམས་ཀྱི་ཚོགས་སུ་བསྡུར་མེད་པར་བསྟན་ཏོ།
en: The subsection of the passage saying “it cannot be said to be… at all” teaches that a name is not included in the collection of dharmas—the aggregates, constituents, sense fields, and so on.

source: །གང་ཡང་བརྗོད་དུ་མ་མཆིས་ཞེས་བྱ་བའི་འགྲེས་ཀྱིས་དགེ་བ་དང་མི་དགེ་བ་དང་། ཁ་ན་མ་ཐོ་བ་དང་བཅས་པ་དང་། ཁ་ན་མ་ཐོ་བ་མེད་པ་ལ་སོགས་པའི་ཆོས་ཉིད་ཀྱི་ནང་དུ་བསྡུར་མེད་པར་བསྟན་ཏོ། །གང་གིས་ཀྱང་བརྗོད་དུ་མ་མཆིས་པ་ལགས་སོ་ཞེས་བགྱི་བའི་འགྲེས་ཀྱིས་ཤིན་ཏུ་མེད་ཀྱང་། འཇིག་རྟེན་ན་གྲགས་པ་རྨི་ལམ་དང་། སྒྱུ་མ་དང་། སྨིག་རྒྱུ་དང་། དྲི་ཟའི་གྲོང་ཁྱེར་དང་། བྲག་ཅ་དང་། མིག་ཡོར་དང་། གཟུགས་བརྙན་དང་། སྤྲུལ་པ་རྣམས་དང་། ཀུན་བརྟགས་པ་ཙམ་གྱི་མཚན་ཉིད་དུ་གྲགས་པ་དང་། ས་དང་། ཆུ་དང་། མེ་དང་། རླུང་རྣམས་དང་། ཡོངས་སུ་གྲུབ་པའི་མཚན་ཉིད་དུ་གྲགས་པ། དེ་བཞིན་ཉིད་དང་། མ་ནོར་བ་དེ་བཞིན་ཉིད་དང་། གཞན་མ་ཡིན་པ་དེ་བཞིན་ཉིད་དང་། ཆོས་ཉིད་དང་།
en: The subsection of the passage saying “cannot be said to be anything” teaches not being included in the true dharmic nature of “wholesome or unwholesome or neutral, basic immorality or not basic immorality,” and so on.

source: ཆོས་ཀྱི་དབྱིངས་དང་། ཆོས་གནས་པ་ཉིད་དང་། ཆོས་སྐྱོན་མེད་པ་ཉིད་དང་། ཡང་དག་པའི་མཐའ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ཆོས་ཉིད་དུ་གྲགས་པ། ཕ་རོལ་ཏུ་ཕྱིན་པ་ཐམས་ཅད་དང་། ཉན་ཐོས་ཀྱི་ཆོས་ཉིད་དུ་གྲགས་པའི་ཚུལ་ཁྲིམས་དང་། ཏིང་ངེ་འཛིན་དང་། ཤེས་རབ་དང་། རྣམ་པར་གྲོལ་བ་དང་། རྣམ་པར་གྲོལ་བའི་ཡེ་ཤེས་མཐོང་བ་དང་། རྒྱུན་ཏུ་ཞུགས་པ་དང་། ལན་ཅིག་ཕྱིར་འོང་བ་དང་། ཕྱིར་མི་འོང་བ་དང་། དགྲ་བཅོམ་པ་དང་། རང་སངས་རྒྱས་རྣམས་དང་། རྒྱུན་ཏུ་ཞུགས་པ་ལ་སོགས་པའི་ཆོས་རྣམས་དང་། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་དང་། བྱང་ཆུབ་སེམས་དཔའི་ཆོས་རྣམས་དང་།
en: The subsection of the passage saying “cannot be said by anything at all” teaches by saying the names for “dream, illusion, mirage, city of the gandharvas, echo, apparition, a reflection in the mirror, and magical creation,” which are absolutely nonexistent but still are renowned in the world; for “space, earth, water, fire, and wind,” which are renowned as having the mark of just conceptualized phenomena; for “suchness, unmistaken suchness, unaltered suchness, true nature of dharmas, dharma-constituent, establishment of dharmas, certification of dharmas, and very limit of reality,” which are renowned as having the mark of the thoroughly established; for all the perfections that are renowned as the true dharmic nature of bodhisattvas; for “morality, meditative stabilization, wisdom, liberation, and knowledge and seeing of liberation,” all of which are renowned as the true dharmic nature of śrāvakas; and for “stream enterer, once-returner, non-returner, worthy one, and pratyekabuddha”; and for “stream enterer dharmas,” and so on; and for “bodhisattva, bodhisattva dharmas… and buddha, and buddhadharmas.”

source: སངས་རྒྱས་རྣམས་དང་། སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ཀྱི་མིང་སྨོས་ནས་བསྟན་ཏོ།། །།བམ་པོ་དགུ་པ། དེ་ནས་ཡང་མཐའ་གཉིས་དང་བྲལ་བར་སྒྲུབ་པ་དེ་ཉིད་ཐ་མར་མཇུག་བསྡུས་ནས་ངེས་པར་འབྱུང་བ་བསྟན་པའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ནི་ཕྱིར་མི་ལྡོག་པའི་ས་ལ་མི་གནས་པའི་ཚུལ་གྱིས་གནས་ནས་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ངེས་པར་འབྱུང་བར་རིག་པར་བགྱིའོ་ཞེས་བྱ་བའི་མཐར་ཐུག་པའི་བར་གྱི་གཞུང་གིས་བཤད་དོ།
en: Then, at the end of just that practice free from the two extremes, again, in conclusion, to teach going forth, the passage, up to the end, says, “You should know that bodhisattva great beings stand on the irreversible level by way of not taking their stand on it and will go forth to the knowledge of all aspects.”

source: །དེ་ལྟར་མཐའ་གཉིས་དང་བྲལ་བར་སྒྲུབ་པའི་ཆོས་རྣམས་དང་། མིང་སྨོས་ཏེ་བསྟན་ནས། དེའི་འོག་ཏུ་མི་གནས་པར་སྒྲུབ་པ་བསྟན་པའི་ཕྱིར། བཅོམ་ལྡན་འདས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། གཟུགས་ལ་གནས་པར་མི་བགྱིའོ་ཞེས་བྱ་བ་ལ་སོགས་པ་གསུངས་སོ།
en: Practice that does not stand Having thus given the names and taught the dharmas of the practice free from the two extremes, after that, to teach the practice that does not stand, it says, “Furthermore, Lord, bodhisattva great beings practicing the perfection of wisdom should not stand in form,” and so on.

source: །སྒྲུབ་པ་འདི་ཡང་རྣམ་པ་གཉིས་སུ་བསྟན་ཏེ། ཆོས་རྣམས་ལ་མི་གནས་པ་དང་། ཆོས་ཉིད་ལ་མི་གནས་པའོ།
en: It also teaches this practice in two parts: not standing in dharmas and not standing in the true nature of dharmas.

source: །དེ་ལ་ཆོས་རྣམས་ལ་མི་གནས་པ་ནི་གཟུགས་ལ་གནས་པར་མི་བགྱིའོ་ཞེས་བྱ་བ་ནས། བཅོམ་ལྡན་འདས་རྣམ་གྲངས་དེས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ཡི་གེ་རྣམས་ལ་གནས་པར་མི་བགྱིའོ་ཞེས་བྱ་བའི་མཐར་ཐུག་པའི་བར་གྱི་གཞུང་གིས་བཤད་དོ།
en: Among these, not standing in dharmas is the passage from where it says “should not stand in form,” up to, “Because of this one of many explanations, Lord, when bodhisattva great beings are practicing the perfection of wisdom they should not stand in syllables.”

source: །ཆོས་ཉིད་ལ་མི་གནས་པ་ནི། གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པས་གཟུགས་མི་རྟག་གོ་ཞེས་བགྱི་བར་གནས་པར་མི་བགྱི་སྟེ་ཞེས་བྱ་བ་ནས། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་མ་གྱུར་བར་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ངེས་པར་འབྱུང་བར་མི་འགྱུར་རོ་ཞེས་བྱ་བའི་མཐར་ཐུག་པའི་བར་གྱི་གཞུང་གིས་བཤད་དོ།
en: Not standing in the true nature of dharmas is the passage from where it says, “Furthermore, Lord, bodhisattva great beings practicing the perfection of wisdom should not stand in ‘form is impermanent,’ ” and ending with “and therefore do not fulfill the perfection of wisdom and go forth to the knowledge of all aspects.”

source: །མཐའ་གཉིས་དང་བྲལ་བར་སྒྲུབ་པའི་འགྲེས་ཀྱིས་ཐ་མར་ཕྱིར་མི་ལྡོག་པའི་ས་ལ་མི་གནས་པའི་ཚུལ་གྱིས་གནས་ཏེ། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ངེས་པར་འབྱུང་ངོ་ཞེས་བྱ་བ་ལས།
en: At the end of listing the dharmas within the context of explaining the practice free from the two extremes, it says “[they] stand on the irreversible level by way of not taking their stand on it and will go forth to the knowledge of all aspects.”

source: མི་གནས་པའི་ཚུལ་གྱིས་ཞེས་སྨོས་པའི་ཕྱིར་ཚིག་ཐ་མའི་གནས་སྐབས་སུ་མི་གནས་པར་སྒྲུབ་པའི་འགྲེས་སྨོས་པ་ཡིན་པར་སྦྱར་བར་བྱའོ། །ད་ནི་མི་གནས་པར་སྒྲུབ་པ་ཐམས་ཅད་ཀྱི་འགྲེས་དང་པོ་བཤད་པར་བྱ་སྟེ། གཟུགས་ལ་གནས་པར་མི་བགྱིའོ། །ཚོར་བ་དང་།
en: Because it says “by way of not taking their stand,” it should be taken as a segue to the category of the practice that does not stand.

source: འདུ་ཤེས་དང་། འདུ་བྱེད་རྣམས་དང་། རྣམ་པར་ཤེས་པ་ལ་གནས་པར་མི་བགྱིའོ་ཞེས་བྱ་བས་ཕུང་པོ་ལྔ་ལ་གནས་པར་མི་བྱ་བ་བསྟན་ནས། དེ་ནས་ཡང་སོ་སོར་གནས་པར་མི་བྱ་བའི་གཏན་ཚིགས་བསྟན་པའི་ཕྱིར་གཟུགས་ལས་བརྩམས་ཏེ། བཅོམ་ལྡན་འདས་འདི་ལྟར་གཟུགས་ནི་གཟུགས་ཀྱིས་སྟོང་ཏེ།
en: Now an explanation has to be given that lists the dharmas within the context of explaining all the practices that do not stand, so, having taught that they do not stand in the five aggregates, with “[they] should not stand in form; they should not stand in feeling, perception, volitional factors, or consciousness,” it then, taking form as its point of departure, also gives the reason why they do not stand in each of them separately, with, “Lord, it is because form is empty of form… that emptiness of form is not form, and emptiness is not other than form.

source: གཟུགས་ཀྱི་སྟོང་པ་ཉིད་གང་ལགས་པ་དེ་ཡང་གཟུགས་མ་ལགས། སྟོང་པ་ཉིད་ལས་གུད་ན་ཡང་གཟུགས་མ་མཆིས་ཏེ། གཟུགས་ཉིད་ཀྱང་སྟོང་པ་ཉིད། སྟོང་པ་ཉིད་ཀྱང་གཟུགས་སོ་ཞེས་བྱ་བ་གསུངས་སོ།
en: Form itself is emptiness, and emptiness itself is form.”

source: །དགོངས་པ་ནི་འདི་ལྟ་སྟེ་སྔར་གཟུགས་ལ་གནས་པར་མི་བགྱིའོ་ཞེས་བྱ་བ་གསུངས་ནས། འདི་ལྟར་གཟུགས་ནི་གཟུགས་ཀྱིས་སྟོང་ངོ་ཞེས་བྱ་བ་གསུངས་པ་འདི་ལ་གཟུགས་ཀྱང་རྣམ་པ་གསུམ་སྟེ།
en: The intention is as follows: Earlier it said that they “should not stand in form,” and it said that it is “because form is empty of form.”

source: ཀུན་བརྟགས་པའི་གཟུགས་དང་། རྣམ་པར་བརྟགས་པའི་གཟུགས་དང་། ཆོས་ཉིད་ཀྱི་གཟུགས་སོ།
en: There are three types of form: falsely imagined form, conceptualized form, and the true dharmic nature of form.

source: །དེ་ལ་བྱིས་པ་སོ་སོའི་སྐྱེ་བོ་རྣམས་ཀྱི་གཟུགས་སུ་རུང་བ་ལ་སོགས་པའི་མཚན་ཉིད་དུ་བཟུང་བ་དངོས་པོའི་གཟུགས་གང་ཡིན་པ་དེ་ནི་ཀུན་བརྟགས་པའི་གཟུགས་ཞེས་བྱའོ།
en: Among these, the form ordinary foolish beings take to be defined as an easily breakable or seeable real thing is imaginary form.

source: །དེ་ཉིད་རྣམ་པ་གང་གི་དོན་དུ་སྣང་བའི་རྣམ་པར་ཤེས་པའི་ཡུལ་དུ་གྱུར་པ་དེ་ནི་རྣམ་པར་བརྟགས་པའི་གཟུགས་ཞེས་བྱའོ། །ཀུན་བརྟགས་པ་དང་།
en: The aspect in which just that appears as real as an object of consciousness is conceptualized form.

source: རྣམ་པར་བརྟགས་པ་དེ་གཉིས་ཀྱི་རྣམ་པ་དང་བྲལ་བ་ཡོངས་སུ་གྲུབ་པ་དེ་བཞིན་ཉིད་ཙམ་དུ་ཟད་པ་གང་ཡིན་པ་དེ་ནི་ཆོས་ཉིད་ཀྱི་གཟུགས་ཞེས་བྱའོ།
en: Just the bare thoroughly established suchness separated from those two falsely imagined and conceptualized form aspects is the true dharmic nature of form.

source: །དེ་ལ་ཡོངས་སུ་གྲུབ་པ་ཆོས་ཉིད་ཀྱི་གཟུགས་གང་ཡིན་པ་དེ་ནི་ཀུན་བརྟགས་པའི་གཟུགས་སུ་ཡོད་པ་ལ་སོགས་པའི་མཚན་ཉིད་དང་། གཟུགས་སུ་རྣམ་པར་བརྟགས་པ་ཡུལ་གྱི་རྣམ་པར་སྣང་བའི་གཟུགས་ཀྱིས་སྟོང་པས་ན། སྟོང་པ་ཞེས་བྱའོ། །དེ་སྐད་བཤད་པ་དང་།
en: It is “empty” because it is empty of the definitions—being seeable and so on—of imaginary phenomena, and of any form conceptualized as a form appearing in the aspect of an object.

source: ཀུན་བརྟགས་པ་དང་རྣམ་པར་བརྟགས་པའི་གཟུགས་ཀྱིས་སྟོང་པའི་ཆོས་ཉིད་ཀྱི་གཟུགས་གང་ཡིན་པ་དེ་ལ་ཅི་གཟུགས་ཀྱི་མཚན་ཉིད་གཞན་ཞིག་ཀྱང་ཡོད་དམ།
en: When this is said, someone might entertain a doubt, thinking that that which is the true dharmic nature of form empty of the imaginary form and conceptualized form might have a definition of form that is quite other, and it might then also be called “form.”

source: གང་གི་ཕྱིར་དེ་ལ་ཡང་གཟུགས་ཞེས་བྱ་སྙམ་དུ་ཐེ་ཚོམ་ཟ་བ་དེའི་ཕྱིར་གཟུགས་ཀྱི་སྟོང་པ་ཉིད་གང་ལགས་པ་དེ་ཡང་གཟུགས་མ་ལགས་ཞེས་བྱ་བ་བཤད་དེ།
en: It therefore says “that emptiness of form is not form.”

source: ཀུན་བརྟགས་པ་དང་རྣམ་པར་བརྟགས་པའི་གཟུགས་ཀྱིས་སྟོང་པ་གང་ཡིན་པ་དེ་ཉིད་ཡོངས་སུ་གྲུབ་པའི་མཚན་ཉིད་ཆོས་ཀྱི་གཟུགས་དེ་ནི་གཟུགས་ཀྱི་ངོ་བོ་ཉིད་མ་ཡིན་ཏེ། རྣམ་པ་ཐམས་ཅད་དུ་གཟུགས་ཀྱི་རྣམ་པ་ལས་དབེན་པའི་ཕྱིར་རོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: This means the suchness empty of imaginary and conceptualized form that is the true dharmic nature of form marking the thoroughly established does not have form for its intrinsic nature because it is totally isolated from form aspects.

source: །དེ་སྐད་བཤད་པ་དང་གལ་ཏེ་གཟུགས་རྣམ་པ་ཐམས་ཅད་དུ་མེད་ན། འོ་ན་གང་གིས་སྟོང་ན་འདི་ལ་སྟོང་པ་ཉིད་ཅེས་བྱ། ཡུལ་མེད་པའི་སྟོང་པ་ཉིད་ཀྱང་མེད་ལ། ཆོས་ལས་ཆོས་ཉིད་གཞན་པ་ཡང་མི་རིགས་པ་དང་།
en: When this is said, someone might entertain a doubt, thinking that if form is totally nonexistent, well then, that of which it is empty is called “emptiness,” and without the object there is no emptiness, so, a true dharmic nature that is other than a dharma is not tenable, and a dharma that is other than a true dharmic nature is not tenable either.

source: ཆོས་ཉིད་ལས་ཆོས་གཞན་པ་ཡང་མི་རིགས་སོ་སྙམ་དུ་ཐེ་ཚོམ་ཟ་བ་དེའི་ཕྱིར་སྟོང་པ་ཉིད་ལས་གུད་ནས་ཡང་གཟུགས་མ་མཆིས་ཞེས་བྱ་བ་གསུངས་ཏེ།
en: It therefore says “and emptiness is not other than form.”

source: ཇི་སྐད་བསྟན་པར་འགྱུར་ཞེ་ན།
en: What does this teach?

source: དེ་ནི་འདི་ལྟར་ཆུ་མ་དངས་པ་ལ། མ་དངས་པའི་གནས་སྐབས་ན་ནི་རྙོག་པ་ཞེས་བྱ་ལ། དངས་པའི་གནས་སྐབས་ན་ནི་ཆུ་དངས་པ་ཞེས་བྱ་བ་དང་། ཇི་ལྟར་ནམ་མཁའ་མ་དངས་པའི་གནས་སྐབས་ན་ནི་རྨུགས་པ་ཞེས་བྱ་ལ། དངས་པའི་གནས་སྐབས་ན་ནི་ནམ་མཁའ་གསལ་བ་ཞེས་བྱ་བ་དེ་བཞིན་དུ།
en: It means that just as water that is not clear is called “dirty” when it is not clear, and “clear water” when it is clear, and just as space is called “cloudy” when it is not clear, and “clear space” when it is clear, similarly with this emptiness.

source: སྟོང་པ་ཉིད་འདི་ཡང་མ་དག་པའི་གནས་སྐབས་ན་ནི་བྱིས་པ་སོ་སོའི་སྐྱེ་བོ་དང་ཐ་དད་པར་མ་གྱུར་པའི་ཕྱིར། གཟུགས་ལ་སོགས་པའི་ཚིག་ཏུ་བརྗོད་ལ་དག་པའི་གནས་སྐབས་ན་ནི་སྟོང་པ་ཉིད་ཅེས་བྱའོ།
en: In nonpure contexts you use the word “form” and so on for it, in order not to be different from ordinary fools, and in pure contexts you call it “emptiness.”

source: །དེ་བས་ན་སྟོང་པ་ཉིད་ལས་ཐ་དད་པར་གྱུར་པའི་གཟུགས་ལ་སོགས་པའི་ཆོས་ནི་མེད་དོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: Therefore the dharmas, form and so on, that are different from emptiness do not exist.

source: །དེ་ལྟར་ཆོས་དང་ཆོས་ཉིད་དག་ལ་ཐ་དད་པ་མེད་པར་གྱུར་པས། གང་གི་ཚེ་ཆོས་ཉིད་ཀྱིས་ཆོས་བརྗོད་པ་དེའི་ཚེ་གཟུགས་ཉིད་ཀྱང་སྟོང་པ་ཉིད་ཅེས་བྱའོ། །གང་གི་ཚེ་ཆོས་ཀྱིས་ཆོས་ཉིད་བརྗོད་པར་གྱུར་པ་དེའི་ཚེ་སྟོང་པ་ཉིད་ཀྱང་གཟུགས་སོ་ཞེས་བྱའོ། །ཡང་ན་གཟུགས་ཉིད་ཀྱང་སྟོང་པ་ཉིད།
en: Because a difference between dharmas and the true nature of dharmas does not exist, when you set forth a dharma as the true dharmic nature “form itself is emptiness, and” when you have set forth the true dharmic nature as a dharma “emptiness itself is form.”

source: སྟོང་པ་ཉིད་ཀྱང་གཟུགས་སོ་ཞེས་བྱ་བ་ལ་སྟོང་པ་ཉིད་ནི་དེ་བཞིན་ཉིད་དེ་ཆོས་ཉིད་ཀྱི་གཟུགས་ལ་བྱའོ།
en: Alternatively, in “form itself is emptiness, and emptiness itself is form,” take emptiness as suchness, as the true dharmic nature of form.

source: །དེ་ལྟར་ཀུན་བརྟགས་པ་དང་རྣམ་པར་བརྟགས་པའི་གཟུགས་དེ་དག་ཤིན་ཏུ་མེད་པ་དང་། ཡོངས་སུ་གྲུབ་པའི་གཟུགས་ལ་ཡང་གནས་སུ་མི་རུང་བའི་ཕྱིར། གཟུགས་ལ་གནས་པར་མི་བགྱིའོ་ཞེས་བྱ་བ་གསུངས་ཏེ།
en: Thus, it says “they should not stand in form,” because it is not suitable for them to stand in imaginary and conceptualized forms that are absolutely nonexistent, and it is also not suitable for them to stand in thoroughly established form.

source: དེ་བཞིན་དུ་ཚོར་བ་ལ་སོགས་པ་ལ་ཡང་སྦྱར་བར་བྱའོ།
en: Similarly, connect this with “feeling” and so on. “

source: །ཡི་གེ་རྣམས་ལ་གནས་པར་མི་བགྱི་ཞེས་བྱ་བ་ནི་ཨ་ཞེས་བྱ་བ་ལ་སོགས་པ་ཡི་གེའི་འབྲུ་རྣམས་ལ་གནས་པར་མི་བྱའོ།
en: Should not stand in syllables” and so on—they should not stand in seed syllables. “

source: །ཡི་གེ་མངོན་པར་སྒྲུབ་པ་ལ་གནས་པར་མི་བགྱི་ཞེས་བྱ་བ་ནི་ཨ་ཞེས་བྱ་བ་ལ་སོགས་པའི་ཡི་གེའི་འབྲུ་རྣམས་ལ་བརྟེན་ནས་སྐྱེ་བ་མེད་པའི་དོན་གྱི་རྗེས་སུ་འབྲང་བའི་གཟུངས་ཀྱི་ཤེས་པ་སྐྱེ་བ་གང་ཡིན་པ་དེ་ལ་ཡི་གེ་མངོན་པར་སྒྲུབ་པ་ཞེས་བྱ་བའི་སྒྲར་བརྗོད་དེ།
en: Should not stand in syllable accomplishment”— the term “syllable accomplishment” is used for the production of the knowledge of anutpāda (“nonproduction”) after resorting to the seed syllable a, and so on, used as a dhāraṇī.

source: དེ་ལ་ཡང་གནས་པར་མི་བྱའོ་ཞེས་བསྟན་ཏོ།
en: This teaches that they should not stand there either.

source: །གཟུངས་ཀྱི་ཤེས་པ་དེ་ཡང་གཟོད་མ་ནས་མ་སྐྱེས་པའི་ཕྱིར། ཨ་ཞེས་བྱ་བ་ནི་ཆོས་ཐམས་ཅད་ཀྱི་སྒོ་ཞེས་བྱ་བ་དེ་ལྟ་བུར་བརྗོད་པ་ལས་མངོན་པར་འགྲུབ་པའོ།
en: That dhāraṇī knowledge is a product of such explanations as “a is the door to all dharmas because they are unproduced from the very beginning.”

source: །ཚིག་ཏུ་བརྗོད་པ་དེ་ཡང་བྱང་ཆུབ་སེམས་དཔའ་དབང་པོ་རབ་ཏུ་རྣོ་བ་ཁ་ཅིག་གིས་ནི་སྐྱེ་བ་མེད་པའི་དོན་གཅིག་ལ་བརྟེན་ཏེ་ཞུགས་ན་མངོན་པར་རྫོགས་པར་བྱང་ཆུབ་པའི་རྐྱེན་དུ་འགྱུར་རོ།
en: That statement, furthermore, becomes a condition for full awakening when certain bodhisattvas with sharp faculties resort to the single statement and enter into the meaning of nonproduction.

source: །དབང་པོ་བར་མ་རྣམས་ཀྱིས་ནི་ཡི་གེ་གཉིས་ལ་བརྟེན་ནས། ཚིག་ཏུ་བརྗོད་པ་གཉིས་ལ་གོམས་པར་བྱས་པ་ལས་འགྱུར་རོ།
en: It happens when those with middling faculties resort to two syllables and have become familiar with two statements.

source: །དབང་པོ་རྟུལ་པོ་རྣམས་ཀྱིས་ནི་ཚིག་ཏུ་བརྗོད་པ་དུ་མ་ལ་བརྟེན་ནས་གོམས་པར་བྱས་ན་མངོན་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱི་རྐྱེན་དུ་འགྱུར་ཏེ།
en: Many statements become a condition for full awakening when those with dull faculties resort to them and have become familiar with them.

source: དེ་བས་ན་གཅིག་བརྗོད་པ་དང་གཉིས་བརྗོད་པ་དང་མང་པོ་བརྗོད་པ་ལ་གནས་པར་མི་བྱའོ་ཞེས་བྱ་བ་གསུངས་སོ།
en: Hence it says “should not stand… in a single explanation, in two explanations, or in a number of different explanations.”

source: །ཆོས་ཉིད་མི་གནས་པའི་འགྲེས་ལ་ཡང་། གཟུགས་མི་རྟག་པ་ནི་གཟུགས་མི་རྟག་པའི་ངོ་བོ་ཉིད་ཀྱིས་སྟོང་སྟེ་ཞེས་བྱ་བ་ལ་ཉན་ཐོས་དང་རང་སངས་རྒྱས་རྣམས་ཀྱི་མི་རྟག་པ་ནི་སྐྱེ་བ་དང་། འགག་པའི་མཚན་ཉིད་དེ།
en: Also, in the subsection of the passage about not standing in the true nature of dharmas, it says “form that is impermanent is empty of the intrinsic nature of form that is impermanent.” The impermanence of śrāvakas and pratyekabuddhas is marked by production and cessation, that is, is marked as a falsely imagined phenomenon.

source: ཀུན་བརྟགས་པའི་མཚན་ཉིད་དོ། །བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་མི་རྟག་པའི་མཚན་ཉིད་ལ་བརྟེན་ནས་མེད་པའི་དོན་ནི་མི་རྟག་པའི་དོན་ཏོ་ཞེས་བཤད་དེ།
en: The nonexistent thing that is the meaning based on the bodhisattvas’ definition of impermanence is said to be “the meaning of impermanence.”

source: འདི་ལྟར་རྟག་ཏུ་ཡོད་པ་ལ་རྟག་པ་ཞེས་བྱའོ།
en: Thus, existing permanently is called permanence.

source: །དེ་ལས་བརྗོད་པ་རྟག་ཏུ་མེད་ཅིང་དུས་ཐམས་ཅད་དུ་མེད་པ་ལ་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་མི་རྟག་པ་ཞེས་བྱའོ།
en: A permanently nonexistent thing, being nonexistent at all times, the opposite of that, is said to be the bodhisattvas’ impermanence.

source: །དེ་བས་ན་མེད་པའི་མཚན་ཉིད་ནི་དོན་དམ་པར་མི་རྟག་པ་ཉིད་དོ།
en: Hence it is saying that impermanence is ultimately marked by nonexistence. “

source: །གཟུགས་མི་རྟག་པ་ནི་གཟུགས་མི་རྟག་པའི་ངོ་བོ་ཉིད་ཀྱིས་སྟོང་ངོ་ཞེས་བྱ་བ་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་དོན་དམ་པར་མི་རྟག་པ་གང་ཡིན་པ་དེ་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་རྣམས་ཀྱིས་ཀུན་བརྟགས་པའི་སྐྱེ་བ་དང་འགག་པའི་མཚན་ཉིད་ཀྱི་མི་རྟག་པའི་ངོ་བོ་ཉིད་ཀྱིས་སྟོང་པའོ།
en: Form that is impermanent is empty of the intrinsic nature of form that is impermanent”: that true reality, the ultimately “impermanent” of the bodhisattvas, is “empty of the intrinsic nature of the impermanent” marked by production and cessation that is conceptualized by śrāvakas and pratyekabuddhas. “

source: གཟུགས་མི་རྟག་པའི་སྟོང་པ་ཉིད་གང་ལགས་པ་དེ་ཡང་གཟུགས་མི་རྟག་པ་ཉིད་མ་ལགས་སོ་ཞེས་བྱ་བ་གསུངས་ཏེ།
en: It says, “Also, that which is the emptiness of form that is impermanent is not the impermanence of form.”

source: འདི་ལྟར་དོན་དམ་པར་གཟུགས་མི་རྟག་པ་ཉིད་ཀྱི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དེ། ཀུན་བརྟགས་པའི་གཟུགས་མི་རྟག་པ་ཉིད་ཀྱི་ངོ་བོ་ཉིད་མ་ཡིན་ཏེ། དེ་བས་ན་དོན་དམ་པའི་གཟུགས་མི་རྟག་པ་ཉིད་ནི་ཀུན་བརྟགས་པའི་གཟུགས་མི་རྟག་པ་ཉིད་ཀྱིས་སྟོང་ངོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: This means that that which, ultimately, is the true reality that is the impermanence of form is not the intrinsic nature of the impermanence of imaginary form, and therefore the ultimate impermanence of form is empty of the impermanence of imaginary form.
